trade_exp/src/InformationRegisters/РекомендуемыйПроцентНаценки/РекомендуемыйПроцентНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="513b7a03-3a94-44b3-91c8-5eac82dd2b15">
  <name>РекомендуемыйПроцентНаценки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="ea9f737b-0b6f-4d9b-bdc4-08cd7d3f1587">
    <name>Наценка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="79a8c9a1-c96d-467d-8962-24fec1cc8fd6">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f981b1b3-5645-4459-88bb-f0a127d53947">
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="f8be902b-fa61-452c-805e-9c2cfd72d9a0">
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="081076f5-ef07-44c6-b33f-09721e0e9300">
    <name>ГруппаВидовЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/РекомендуемыйПроцентНаценки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы());
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыиФункции
&НаКлиенте
Функция СтруктураТаблицы()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ТоварнаяКатегория",
		"СправочникСсылка.ТоварныеКатегории#Товарная категория#30#1#Справочники.ТоварныеКатегории.НайтиПоНаименованию(""&Ячейка&"")#ТоварнаяКатегория");
	СтруктураТаблицы.Вставить("ГруппаВидовЦен", "СправочникСсылка.ГруппировкиВидовЦен#Группа видов цен#20#1#Справочники.ГруппировкиВидовЦен.НайтиПоНаименованию(""&Ячейка&"")#ГруппаВидовЦен");
	СтруктураТаблицы.Вставить("Наценка", "число#Наценка#10");
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.РекомендуемыйПроцентНаценки.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		//	Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;
Элементы.Список.Обновить();
КонецПроцедуры


#КонецОбласти
